Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/торо_ИзменениеПоложенияВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИзменениеПоложенияВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПоложенияВСтруктуреИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	
	торо_ЛокализацияМодификацияФорм.ПеревестиДинамическийСписок(ЭтаФорма, Список, "Комментарий,Наименование",
		Метаданные.Справочники.торо_ОбъектыРемонта);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ФОИспользоватьФункциональныеМеста", Новый ОписаниеТипов("Булево")));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] = Константы.торо_ИспользоватьФункциональныеМеста.Получить();
	//
	НГруппа = элементы.Добавить("ПодменюФМ", Тип("ГруппаФормы"), Элементы.ОсновнаяКоманднаяПанель);
	НГруппа.Заголовок = НСтр("en='Add FP';es='Añadir fm';ru='Добавить ФМ'");
	НГруппа.Вид = ВидГруппыФормы.Подменю;
	НГруппа.Видимость = ЭтотОбъект["ФОИспользоватьФункциональныеМеста"];
	//
	НКом = Команды.Добавить("СоздатьФМ");
	НКом.Действие = "СоздатьФМ";
	НКом.Заголовок = НСтр("en='New';es='Nuevo';ru='Новое'");
	НКом.Подсказка = "Создать функциональное место";
	НКом.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	//
	НЭлем = Элементы.Добавить("Кнопка_СоздатьФМ", Тип("КнопкаФормы"), Элементы["ПодменюФМ"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "СоздатьФМ";
	//
	НКом = Команды.Добавить("ДобавитьФМИзИерархии");
	НКом.Действие = "ФМИзДругойИерархии";
	НКом.Заголовок = НСтр("en='From a different hierarchy';es='De otra jerarquía';ru='Из другой иерархии'");
	НКом.Подсказка = "Создать функциональное место";
	НКом.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	//
	НЭлем = Элементы.Добавить("Кнопка_ДобавитьФМИзИерархии", Тип("КнопкаФормы"), Элементы["ПодменюФМ"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ДобавитьФМИзИерархии";
	//
	ТемпСтрукт = Новый Структура("ФормаСоздатьГруппу,ФормаИзменить,ПереключитьНаВидДерева",
		Неопределено, Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,Элементы);
	Если Не ТемпСтрукт.ФормаСоздатьГруппу = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ФормаСоздатьГруппу);
	ИначеЕсли Не ТемпСтрукт.ФормаИзменить = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ФормаИзменить);
	ИначеЕсли Не ТемпСтрукт.ПереключитьНаВидДерева = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ПереключитьНаВидДерева);
	КонецЕсли;
	
	// гкс+ [8220] Тарасов 19.10.2020
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК СтатусВУчете", 
																"НЕОПРЕДЕЛЕНО КАК СтатусВУчете,
																|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК гкс_ПриоритетОР");
	
	НЭлем = Элементы.Вставить("гкс_ПриоритетОР", Тип("ПолеФормы"), Элементы.Список, Элементы.Код);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_ПриоритетОР";
	// гкс+ [] Деснол 16.08.2022
	НЭлем.Заголовок = НСтр("ru='Категория риска';
	// гкс- [] Деснол 16.08.2022
							|en='Repair object priority';
							|es='Prioridad de objeto de reparación'");
	
	гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список);
	// гкс- [8220] Тарасов 19.10.2020
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФМ(Команда)
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	Если Не ТекДанные = Неопределено Тогда 
		ТемпРодитель = ТекДанные.Ссылка;
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаЭлемента",
		Новый Структура("СтруктураИерархии, РодительИерархии, СоздатьФМ", ТекСтруктураИерархии, ТемпРодитель, Истина));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФМИзДругойИерархии()
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;

	Если Не ТекДанные = Неопределено Тогда 
		ТемпРодитель = ТекДанные.Ссылка;
		СтруктураОпОп = Новый Структура("Родитель, Иерархия", ТемпРодитель, ТекСтруктураИерархии);
		ОписаниеОповещенияФормыВыбора = Новый ОписаниеОповещения("ДобавитьФМВИерархию", ЭтотОбъект, СтруктураОпОп);
		СтрПарметрыФормы = Новый Структура("ОтборТипОбъекта,ИспользоватьОтборТипОбъекта",
				торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "ФункциональноеМесто"), Истина);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",СтрПарметрыФормы,,,,, 
			ОписаниеОповещенияФормыВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФМВИерархию(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		Если ДопПараметры.Родитель = Результат Тогда 
			Возврат;
		КонецЕсли;
		ДобавитьФМВИерархиюНаСервере(Результат, ДопПараметры.Родитель, ДопПараметры.Иерархия);
		
		торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтаФорма, "Дерево");
		Если КореньПолногоДерева <> Неопределено Тогда 
			ОбновитьПолноеДерево(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьФМВИерархиюНаСервере(ФМ, Родитель, Иерархия)
	Если ТипЗнч(ФМ) = Тип("Массив") Тогда 
		Для Каждого СтрокаМассива Из ФМ Цикл
			Если Иерархия.ИзменяетсяДокументами Тогда 
				НовыйДокумент = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Комментарий = НСтр("ru = 'Добавлен из другой иерархии';"
				+ " en = 'Added from a different hierarchy'; es = 'Agregado de una jerarquía diferente'");
				НовыйДокумент.СтруктураИерархии = Иерархия;
				НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НоваяСтрока = НовыйДокумент.ПоложенияВСтруктуреИерархии.Добавить();
				НоваяСтрока.ОбъектИерархии = СтрокаМассива;
				НоваяСтрока.РодительИерархии = Родитель;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НаборЗаписей = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОбъектИерархии.Установить(СтрокаМассива);
				НаборЗаписей.Отбор.СтруктураИерархии.Установить(Иерархия);
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ОбъектИерархии = СтрокаМассива;
				НоваяСтрока.СтруктураИерархии = Иерархия;
				НоваяСтрока.РодительИерархии = Родитель;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Иерархия.ИзменяетсяДокументами Тогда 
			НовыйДокумент = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Комментарий = НСтр("ru = 'Добавлен из другой иерархии';"
			+ " en = 'Added from a different hierarchy'; es = 'Agregado de una jerarquía diferente'");
			НовыйДокумент.СтруктураИерархии = Иерархия;
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НоваяСтрока = НовыйДокумент.ПоложенияВСтруктуреИерархии.Добавить();
			НоваяСтрока.ОбъектИерархии = ФМ;
			НоваяСтрока.РодительИерархии = Родитель;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НаборЗаписей = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектИерархии.Установить(ФМ);
			НаборЗаписей.Отбор.СтруктураИерархии.Установить(Иерархия);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ОбъектИерархии = ФМ;
			НоваяСтрока.СтруктураИерархии = Иерархия;
			НоваяСтрока.РодительИерархии = Родитель;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [8220] Тарасов 19.10.2020
&НаСервереБезКонтекста
Процедура гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК КатегорииРиска,
	|	торо_КатегорииРиска.Представление КАК Представление,
	|	торо_КатегорииРиска.Цвет КАК Цвет
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = ""+Выборка.Представление;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Выборка.КатегорииРиска;
		
		ЦветФона = Выборка.Цвет.Получить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		  
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР");
		
	КонецЦикла;
	
КонецПроцедуры// гкс- [8220] Тарасов 19.10.2020

#КонецОбласти
